Смотрим на задание и видим две строчки: 
> 1. регулярное выражение: `surctf_([p1l]{1}[3rk_n]{2}[so1]){3}`  
> 2. флаг хэшированный с помощью md5: `5f1824397c92c1860e87c987c3684f40`  

Если вы первый раз слышите про регулярные выражения и сосвсем не понимаете что тут происходит, вот ссылочка на хороший пост на хабре про регулярки на питоне ([пост](https://habr.com/ru/post/349860/))  

По категории задания (PPC) мы понимаем что нам нужно написать какой-то скрипт, который что-то делает. По регулярному выражению мы понимаем, что это шаблон флага, но под этот шаблон подходят очень много вариантов флага (в точности 11390625 вариантов), а нам нужен только один верный флаг, чтобы решить задание. Именно для этого нам дан хэш с правильным флагом. Значит нужно написать программу, которая будет перебирать все возможные варианты флага по этому регулярному выражению, хэшировать и сравнивать с данным хэшем, пока хэши не совпадут. Если хэши совпадут, то это правильный флаг... \*РаДуЕмСя\*

Давайте попытаемся разобрать регулярку, чтобы понять как составляются строчки и что вообще там происходит.

Для начала вспомним, что в квадратных скобках пишутся буквы или символы которые будут использоваться, пример:
> regex: `surctf_[abcd]`
> 1. surctf_a
> 2. surctf_b
> 3. surctf_c
> 4. surctf_d

Потом вспомним, что в фигурных скобках пишут число n (n повторений), пример:
> regex: `surctf_[ab]{2}`
> 1. surctf_aa
> 2. surctf_ab
> 3. surctf_bb
> 4. surctf_ba

С этими знаниями пробуем написать простой перебор вариантов флага на `python`:
```python
import hashlib

def md5(n):
  return hashlib.md5(n.encode('utf-8')).hexdigest()

list_of_parts = []
for i1 in 'p1l':
  for i2 in '3rk_n':
    for i3 in '3rk_n':
      for i4 in 'so1':
        part = i1 + i2 + i3 + i4
        list_of_parts.append(part)

for j1 in list_of_parts:
  for j2 in list_of_parts:
    for j3 in list_of_parts:
      flag = 'surctf_' + j1 + j2 + j3
      if md5(flag) == '5f1824397c92c1860e87c987c3684f40':
        print(flag)
```

Также есть второй способ решения с помощью библиотеки `exrex` и функции `generate` на `python`:
```python
import hashlib
import exrex

def md5(n):
  return hashlib.md5(n.encode('utf-8')).hexdigest()

# генерирует лист со всеми возможными флагами по регулярке
reg_list = list(exrex.generate(r'surctf_([p1l]{1}[3rk_n]{2}[so1]){3}'))

for flag in reg_list:
  if md5(flag) == '5f1824397c92c1860e87c987c3684f40':
    print(flag)
```

`flag: surctf_p3rs1k_ol3n1`
